{
    "title": "Data Mining Examples: Recommendation Systems",
    "video_segment": "35:00 - 38:59",
    "content_flow": [
        {
            "content_type": "slide_description",
            "text": "The slide is titled 'Data Mining Examples: Recommendation Systems'. It lists values for service providers and customers. For service providers, it includes: Values for the service providers, Increase sales, Opportunities for promotion. For customers, it includes: Narrow down the interesting items being identified. Under 'Examples', it states: Netflix: 2/3 of the movies watched are recommended. Amazon: 35% sales from recommendation. The slide also shows logos of Netflix and Blockbuster."
        },
        {
            "content_type": "transcript_segment",
            "text": "see this two movie and the the United States post office will actually deliver those movie to your home. Okay. And then after work, if you finish reading the movie, you send the movie back and Netflix was sending the next movie to you. That is about that time. Okay. Right now you don't you know Netflix did not operate on that way. Okay. So, the most important thing you might say, Professor just say a lot of thing, nothing related to recommendation. It is called content. I'm talking about all the context for you to understand why such thing will be unique and important. So the thing is, if you are customer, how you are going to play with that kind of deal? I mean, they actually say you can cancel your membership at any time. So for example, if I want to see 10 movie. One way is I go to Blockbuster to rent this 10 movie one by one and then I actually don't need to care about what is the time I need to see the movie because I just went to Blockbuster and then I just try to borrow them and then you need to know around that time Netflix, the price is like their monthly price, it's just like renting one movie from the Blockbuster. That is the price around that time. So if I want to see 10 movie, that way I try to save the money. I go to Netflix and then I try to see the movie within one month, right? Finish all the 10 movie within one month and then I cancel the membership. You can see I saved nine months of the money. So customer probably will knowing that. By the way, I'm trying to tell you that some of the thing when you try to introduce, you need to thinking about who are the people participate with it. What is the expectation about it? So if your customer have that kind of thing, can you actually set up the rule saying that, oh, sorry, no. There's no way that you can do that. Not possible, right? Because then you might need to do one thing is, if you say you cannot cancel your membership at any time, then they will not join in the first place. So they need to know that they have the free will and then they can operate on their own. So the thing is, you need to find a way to engage those user when their 10 movie was done. Then you give them another 10 movie. Are you sure you really want to cancel your membership? Are you sure you want to quit? And then they probably will say, okay, maybe 10 other. And then after they finish the 10, you give them another 10. Okay? That is called recommendation system. So recommendation system is for customers, you cannot allow your customer go. So then afterward, you can see this one we give you some example. Netflix, in the end, you know what is Netflix. A lot of people don't know Blockbuster. Blockbuster go, Netflix stay. And then based on their some of the record before like 10 years ago, they say two out of third of the movie watched are recommended. So which means their recommendation system are good enough. And from Amazon, Amazon is the one try to sell thing, they can also tell you",
            "timestamp": "35:00"
        }
    ]
}